app/Controllers/Catalogo_controller.php

SELECT *
FROM `categoria`
WHERE `baja` = 'NO'
SELECT `producto`.*, `categoria`.`nombre` as `categoria`
FROM `producto`
JOIN `categoria` ON `producto`.`id_categoria` = `categoria`.`id_categoria`
WHERE `producto`.`baja` = 'NO'
AND `producto`.`cantidad` > 0
---
    public function index()
    {
        $productoModel = new productoModelo();
        $categoriaModel = new categoriaModelo();

        $categorias = $categoriaModel->where('baja', 'NO')->findAll();
        $categoriaSeleccionada = $this->request->getGet('categorias');

        $query = $productoModel
            ->select('producto.*, categoria.nombre as categoria')
            ->join('categoria', 'producto.id_categoria = categoria.id_categoria')
            ->where('producto.baja', 'NO')
            ->where('producto.cantidad >', 0);

        if (!empty($categoriaSeleccionada) && is_array($categoriaSeleccionada)) {
            $query->whereIn('producto.id_categoria', $categoriaSeleccionada);
        }

        $productos = $query->findAll();

SELECT `producto`.*, `categoria`.`nombre` as `categoria`
FROM `producto`
JOIN `categoria` ON `producto`.`id_categoria` = `categoria`.`id_categoria`
WHERE `producto`.`id_producto` = '6'
---
    public function detalle($id_producto)
    {
        $productoModel = new ProductoModelo();
        $producto = $productoModel
            ->select('producto.*, categoria.nombre as categoria')
            ->join('categoria', 'producto.id_categoria = categoria.id_categoria')
            ->find($id_producto);