app/Controllers/Panel_controller.php

    public function cliente()
    {
        $usuarioModel = new usuarioModelo();
        $cliente = $usuarioModel->find(session('id_usuario'));
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id_usuario` = '2'

    public function actualizarCliente()
    {
        $usuarioModel = new usuarioModelo();
        $usuarioModel->update(session('id_usuario'),
                [
                'nombre' => $this->request->getPost('nombre'),
                'apellido' => $this->request->getPost('apellido'),
                'direccion' => $this->request->getPost('direccion'),
                'dni' => $this->request->getPost('dni'),
                'nombre_usuario' => $this->request->getPost('nombre_usuario'),
                ]);
---
UPDATE `usuario` SET `nombre` = 'Lucas ', `apellido` = 'Rodriguez', `direccion` = 'Calle Altura Numero 12345', `dni` = '44387595', `nombre_usuario` = 'cliente'
WHERE `usuario`.`id_usuario` IN ('2')